[
    {
        "heading": "Что такое операционная система?",
        "text": "Операционная система — это программное обеспечение, которое управляет аппаратными и программными ресурсами компьютера, а также предоставляет интерфейс для взаимодействия пользователя с устройством."
    },
    {
        "heading": "Как расшифровывается аббревиатура CPU?",
        "text": "CPU (Central Processing Unit) — центральный процессор, основной элемент компьютера, выполняющий вычисления и обработку команд программ."
    },
    {
        "heading": "Какая из перечисленных технологий используется для хранения данных?",
        "text": "SSD (Solid State Drive) — твердотельный накопитель, предназначенный для долговременного хранения данных. В отличие от HDD, он работает быстрее и надежнее."
    },
    {
        "heading": "Что такое IP-адрес?",
        "text": "IP-адрес — это уникальный числовой идентификатор устройства в сети, который используется для его адресации и взаимодействия с другими устройствами."
    },
    {
        "heading": "Какой из языков программирования является объектно-ориентированным?",
        "text": "Python — это высокоуровневый язык программирования, поддерживающий объектно-ориентированный подход, что упрощает моделирование реальных систем."
    },
    {
        "heading": "Что такое алгоритм?",
        "text": "Алгоритм — это последовательность шагов или инструкций, направленных на выполнение определенной задачи или решение проблемы."
    },
    {
        "heading": "Какой протокол используется для передачи веб-страниц?",
        "text": "HTTP (HyperText Transfer Protocol) — это протокол передачи гипертекста, который используется для передачи данных между веб-сервером и клиентом."
    },
    {
        "heading": "Какой из типов памяти является энергозависимым?",
        "text": "RAM (Random Access Memory) — оперативная память, данные в которой сохраняются только при включенном питании устройства."
    },
    {
        "heading": "Что обозначает термин 'компиляция'?",
        "text": "Компиляция — это процесс преобразования исходного кода программы в исполняемый машинный код, понятный компьютеру."
    },
    {
        "heading": "Какую функцию выполняет BIOS?",
        "text": "BIOS (Basic Input/Output System) — это базовая система ввода-вывода, которая отвечает за начальную загрузку компьютера и проверку его оборудования."
    },
    {
        "heading": "Какой из языков программирования создан для работы с базами данных?",
        "text": "SQL (Structured Query Language) — это язык структурированных запросов, используемый для работы с реляционными базами данных."
    },
    {
        "heading": "Какой из типов атак связан с перехватом данных в сети?",
        "text": "MITM (Man-In-The-Middle) — это атака, при которой злоумышленник перехватывает данные между двумя сторонами, оставаясь незаметным."
    },
    {
        "heading": "Как называется процесс восстановления данных после сбоев?",
        "text": "Восстановление — это процесс восстановления данных из резервных копий или других источников после сбоев или повреждений."
    },
    {
        "heading": "Какая единица измерения информации является минимальной?",
        "text": "Бит — это минимальная единица измерения информации, которая может принимать одно из двух значений: 0 или 1."
    },
    {
        "heading": "Как называется часть программы, выполняющаяся одновременно с другими?",
        "text": "Поток — это часть программы, которая может выполняться параллельно с другими потоками в рамках одного процесса."
    },
    {
        "heading": "Что такое URL?",
        "text": "URL (Uniform Resource Locator) — это унифицированный указатель ресурса, который используется для адресации веб-страниц в Интернете."
    },
    {
        "heading": "Какой из элементов отвечает за графическую обработку?",
        "text": "GPU (Graphics Processing Unit) — графический процессор, предназначенный для обработки изображений, видео и графики в реальном времени."
    },
    {
        "heading": "Что такое open source?",
        "text": "Open source — это программное обеспечение с открытым исходным кодом, которое можно свободно изменять и распространять."
    },
    {
        "heading": "Какой протокол используется для безопасного соединения?",
        "text": "HTTPS (HyperText Transfer Protocol Secure) — это протокол передачи данных с использованием шифрования для обеспечения безопасности соединений."
    },
    {
        "heading": "Какая структура данных работает по принципу 'первым пришел — первым вышел'?",
        "text": "Очередь — это структура данных, где элементы обрабатываются в порядке их поступления: первый элемент, вошедший в очередь, обрабатывается первым."
    }
]